## Data Wrangling

In [48]:
import pandas as pd
import numpy as np

In [49]:
 df = pd.read_csv('Test.csv')

In [50]:
df.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
0,458989,Female,Yes,36,Yes,Engineer,0.0,Low,1.0,Cat_6
1,458994,Male,Yes,37,Yes,Healthcare,8.0,Average,4.0,Cat_6
2,458996,Female,Yes,69,No,NaN,0.0,Low,1.0,Cat_6
3,459000,Male,Yes,59,No,Executive,11.0,High,2.0,Cat_6
4,459001,Female,No,19,No,Marketing,NaN,Low,4.0,Cat_6

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2627 entries, 0 to 2626
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               2627 non-null   int64
 1   Gender           2627 non-null   object
 2   Ever_Married     2577 non-null   object
 3   Age              2627 non-null   int64
 4   Graduated        2603 non-null   object
 5   Profession       2589 non-null   object
 6   Work_Experience  2358 non-null   float64
 7   Spending_Score   2627 non-null   object
 8   Family_Size      2514 non-null   float64
 9   Var_1            2595 non-null   object
dtypes: float64(2), int64(2), object(6)
memory usage: 205.4+ KB

In [52]:
df.drop('ID', inplace = True, axis = 1)

In [53]:
df.rename(columns = { 'Var_1':'Category'}, inplace = True)

In [54]:
df.head()

,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Category
0,Female,Yes,36,Yes,Engineer,0.0,Low,1.0,Cat_6
1,Male,Yes,37,Yes,Healthcare,8.0,Average,4.0,Cat_6
2,Female,Yes,69,No,NaN,0.0,Low,1.0,Cat_6
3,Male,Yes,59,No,Executive,11.0,High,2.0,Cat_6
4,Female,No,19,No,Marketing,NaN,Low,4.0,Cat_6

In [55]:
df.isnull().values.any()

True

In [56]:
df.isnull().sum()

Gender               0
Ever_Married        50
Age                  0
Graduated           24
Profession          38
Work_Experience    269
Spending_Score       0
Family_Size        113
Category            32
dtype: int64

In [57]:
missing = pd.concat([df.isnull().sum(), 100 * df.isnull().mean()], axis=1)
missing.columns=['count','%']
missing.sort_values(by='count')

                 count          %
Gender               0   0.000000
Age                  0   0.000000
Spending_Score       0   0.000000
Graduated           24   0.913590
Category            32   1.218120
Profession          38   1.446517
Ever_Married        50   1.903312
Family_Size        113   4.301485
Work_Experience    269  10.239817

In [58]:
df.fillna(method='ffill', inplace = True)

In [59]:
df.isnull().sum()

Gender             0
Ever_Married       0
Age                0
Graduated          0
Profession         0
Work_Experience    0
Spending_Score     0
Family_Size        0
Category           0
dtype: int64

In [60]:
df.head()

,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Category
0,Female,Yes,36,Yes,Engineer,0.0,Low,1.0,Cat_6
1,Male,Yes,37,Yes,Healthcare,8.0,Average,4.0,Cat_6
2,Female,Yes,69,No,Healthcare,0.0,Low,1.0,Cat_6
3,Male,Yes,59,No,Executive,11.0,High,2.0,Cat_6
4,Female,No,19,No,Marketing,11.0,Low,4.0,Cat_6

In [61]:
df['Profession'].unique()

array(['Engineer', 'Healthcare', 'Executive', 'Marketing', 'Doctor',
       'Artist', 'Lawyer', 'Entertainment', 'Homemaker'], dtype=object)

In [62]:
df['Spending_Score'].unique()

array(['Low', 'Average', 'High'], dtype=object)

In [76]:
df['Work_Experience'].unique()

array([ 0,  8, 11,  5,  1,  2,  9,  3,  6,  7,  4, 13, 10, 12, 14])

In [65]:
df['Category'].unique()

array(['Cat_6', 'Cat_4', 'Cat_3', 'Cat_1', 'Cat_2', 'Cat_5', 'Cat_7'],
      dtype=object)

In [67]:
# Female = 0, Male = 1
df['Gender'] = df['Gender'].map({'Female': 0, 'Male': 1}).astype(int)

#Ever_married, yes = 1, no = 0
df['Ever_Married'] = df['Ever_Married'].map({'Yes': 1, 'No': 0}).astype(int)

#Graduated, yes = 1, no = 0
df['Graduated'] = df['Graduated'].map({'Yes': 1, 'No': 0}).astype(int)

#Profession, Engineer = 1, Healthcare = 2, Executive = 3, Marketing = 4, Doctor = 5, Artist = 6, Lawyer = 7, 
#Entertaiment = 8, Homemaker = 9
df['Profession'] = df['Profession'].map({'Engineer': 1, 
                                         'Healthcare' : 2, 
                                         'Executive': 3, 
                                         'Marketing' : 4, 
                                         'Doctor' : 5,
                                         'Artist' : 6, 
                                         'Lawyer':7,
                                         'Entertainment':8,
                                         'Homemaker': 9}).astype(int)

#Spending score, Low = 1, Average = 2, High = 3
df['Spending_Score'] = df['Spending_Score'].map({'Low':1, 'Average':2, 'High':3}).astype(int)

ValueError: Cannot convert non-finite values (NA or inf) to integer

In [68]:
df.head()

,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Category
0,0,1,36,1,1,0.0,1,1.0,Cat_6
1,1,1,37,1,2,8.0,2,4.0,Cat_6
2,0,1,69,0,2,0.0,1,1.0,Cat_6
3,1,1,59,0,3,11.0,3,2.0,Cat_6
4,0,0,19,0,4,11.0,1,4.0,Cat_6

In [70]:
df['Category'] = df['Category'].apply(lambda x: x.split('_')[1])

In [71]:
df.head()

,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Category
0,0,1,36,1,1,0.0,1,1.0,6
1,1,1,37,1,2,8.0,2,4.0,6
2,0,1,69,0,2,0.0,1,1.0,6
3,1,1,59,0,3,11.0,3,2.0,6
4,0,0,19,0,4,11.0,1,4.0,6

In [72]:
df['Work_Experience'] = df['Work_Experience'].astype(int)

In [73]:
df['Family_Size'] = df['Family_Size'].astype(int)

In [74]:
df.head()

,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Category
0,0,1,36,1,1,0,1,1,6
1,1,1,37,1,2,8,2,4,6
2,0,1,69,0,2,0,1,1,6
3,1,1,59,0,3,11,3,2,6
4,0,0,19,0,4,11,1,4,6

In [75]:
df.to_csv('data_cleaned.csv', index = False)